#Sporify Group Project - Yelp Dataset

###Anılcan Atik
###Dost Karaahmetli
###Kutay Akalın
###Tunahan Kılıç

In [1]:
sudo service postgresql start

Starting PostgreSQL 11 database server: main.

In [2]:
datadir=~/data
yelpdir=$datadir/Yelp

In [3]:
ls -l $yelpdir/

total 347644
-rw-r--r-- 1 jovyan root   1772959 Jan  6 13:02  charlotte_business.csv
-rw-r--r-- 1 jovyan root 219287205 Jan  6 13:02  charlotte_review.csv
-rw-r--r-- 1 jovyan root 134696096 Jan  6 13:03  charlotte_user.csv
-rw-r--r-- 1 jovyan root    220735 Jan  6 13:03 'yelpdb (1).ipynb'

In [4]:
%load_ext sql

In [5]:
%sql postgres://postgres@localhost/postgres

'Connected: postgres@postgres'

In [6]:
sudo mkdir -p /pg1

In [7]:
stat -c "%U %G" /pg1

root root

In [8]:
sudo chown -R postgres:postgres /pg1

In [9]:
%%sql
-- create a new tablespace
END;
CREATE TABLESPACE pg1 LOCATION '/pg1';

 * postgres://postgres@localhost/postgres
Done.
Done.

[]

In [10]:
%%sql
-- create a new database imdb1 on pg1 tablespace
END;
CREATE DATABASE charlotteyelp
TABLESPACE = pg1;

 * postgres://postgres@localhost/postgres
Done.
Done.

[]

In [24]:
%%sql
TRUNCATE TABLE Users;

 * postgres://postgres@localhost/postgres
Done.

[]

In [11]:
%%sql
-- create a new table
CREATE TABLE charlotteuser
( 
  user_id text,
  name text,
  review_count integer,
  yelping_since date,
  friends text,
  useful integer,
  funny integer,
  cool integer,
    fans integer,
    elite text,
    average_stars numeric,
    compliment_hot integer,
    compliment_more integer,
    compliment_profile integer,
    compliment_cute integer,
    compliment_list integer,
    compliment_note integer,
    compliment_plain integer,
    compliment_cool integer,
    compliment_funny integer,
    compliment_writer integer,
    compliment_photos integer
);

 * postgres://postgres@localhost/postgres
Done.

[]

In [12]:
%%sql
COPY charlotteuser from '/home/jovyan/data/Yelp/charlotte_user.csv'
DELIMITER ',' CSV HEADER;

 * postgres://postgres@localhost/postgres
95845 rows affected.

[]

In [54]:
%%sql
SELECT *
FROM charlotteuser
LIMIT 1;

 * postgres://postgres@localhost/postgres
1 rows affected.

[('nsS4oDfOsl20QdWc6XcOkw', 'Cindi', 28, datetime.date(2009, 4, 27), 'fWCNb0fD-ysL85umLrjCNA, 4Tawn1t3QJq8-J9QOpMybw, 9Cp1VdBZo3mM7QtpwSOAlg, uyAWDUEKB2vmOnAx_bUu2A, -pkPYxUimahRvUq0tDSi1g, b0DtZ4Rf8Goa8NkmSAmqYg, PPwQm ... (444 characters truncated) ... wd8_g, Yo12Yp1u2lQdAtyjgQKEaw, BTVJYHJtTvFdPOOZNKzrNQ, 45QXu4kz6PhK6zcmZGoJqQ, 19rAfR1dYymJfhgQZfoo9A, nls8z8Wup-4FUyEtqfDSWA, bjeutWb2fMO454NHyiMpxA', 23, 7, 3, 1, 'NA', Decimal('2.48'), 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0)]

In [14]:
%%sql
CREATE TABLE charlottebusiness
( 
  business_id text,
  name text,
  address text,
  city text,
  state text,
  postal_code text,
  latitude numeric,
  longitude numeric,
  stars numeric,
    review_count integer,
    is_open integer,
    categories text
);

 * postgres://postgres@localhost/postgres
Done.

[]

In [15]:
%%sql
COPY charlottebusiness from '/home/jovyan/data/Yelp/charlotte_business.csv'
DELIMITER ',' CSV HEADER ENCODING 'windows-1251';

 * postgres://postgres@localhost/postgres
9511 rows affected.

[]

In [16]:
%%sql
SELECT *
FROM charlottebusiness
LIMIT 5;

 * postgres://postgres@localhost/postgres
5 rows affected.

[('gnKjwL_1w79qoiV3IC_xQQ', 'Musashi Japanese Restaurant', '10110 Johnston Rd, Ste 15', 'Charlotte', 'NC', '28210', Decimal('35.092564'), Decimal('-80.859132'), Decimal('4'), 170, 1, 'Sushi Bars, Restaurants, Japanese'),
 ('HhyxOkGAM07SRYtlQ4wMFQ', 'Queen City Plumbing', '4209 Stuart Andrew Blvd, Ste F', 'Charlotte', 'NC', '28217', Decimal('35.1900119'), Decimal('-80.8872232'), Decimal('4'), 4, 1, 'Plumbing, Shopping, Local Services, Home Services, Kitchen & Bath, Home & Garden, Water Heater Installation/Repair'),
 ('irft4YkdNsww4DNf_Aftew', 'So Cool Frozen Yogurt', '9020 B Albemarle Rd', 'Charlotte', 'NC', '28227', Decimal('35.21051'), Decimal('-80.690262'), Decimal('4.5'), 6, 0, 'Juice Bars & Smoothies, Food, Ice Cream & Frozen Yogurt'),
 ('BvYU3jvGd0TJ7IyZdfiN2Q', "Manzetti's Tavern", '6401 Morrison Blvd', 'Charlotte', 'NC', '28211', Decimal('35.156338'), Decimal('-80.831878'), Decimal('3.5'), 16, 0, 'Sandwiches, Italian, American (Traditional), American (New), Seafood, Steakhouses, Restaurants'),
 ('Qnz3ywR7BosTr8qDk6G-Pw', 'Mattress Firm Final Markdown', '13129 S Tryon St, Ste 120', 'Charlotte', 'NC', '28278', Decimal('35.1007253747'), Decimal('-80.9920791686'), Decimal('5'), 4, 1, 'Home & Garden, Mattresses, Home Decor, Furniture Stores, Shopping')]

In [17]:
%%sql
-- create a new table
CREATE TABLE charlottereview
( 
  business_id text,
  review_id text,
  user_id text,
  stars integer,
  _date date,
  comment text,
  useful integer,
  funny integer,
  cool integer
);

 * postgres://postgres@localhost/postgres
Done.

[]

In [18]:
%%sql
COPY charlottereview from '/home/jovyan/data/Yelp/charlotte_review.csv'
DELIMITER ',' CSV HEADER;

 * postgres://postgres@localhost/postgres
309533 rows affected.

[]

In [55]:
%%sql
SELECT *
FROM charlottereview
LIMIT 2;

 * postgres://postgres@localhost/postgres
2 rows affected.

[('gnKjwL_1w79qoiV3IC_xQQ', 'F7POrJsNbhu493DSTMPXjw', 'nsS4oDfOsl20QdWc6XcOkw', 2, datetime.date(2014, 2, 24), 'Husband was craving Chicken Teriyaki & gyoza, so we found Musashi. I was very unimpressed. We started with gyoza and edamame. Neither were anything s ... (146 characters truncated) ... n teriyaki sauce. Was not good at all. The sushi was mediocre at best. While they were friendly and the service was pretty good - I will not be back.', 1, 0, 0),
 ('gnKjwL_1w79qoiV3IC_xQQ', 'c-6aA9Bd7JxpmMroRoas9A', 'bK4Y_GZUoAUTXIrmeEUGYw', 4, datetime.date(2014, 7, 13), 'Went there Saturday noon they open at 12pm but people were waiting outside before 12pm so you can tell it should be a good place. Nice Katsu & Eel with rice. Many Japanese go there.', 0, 0, 1)]

###Most active users in Charlotte

In [94]:
%%sql
SELECT user_id, name, review_count, average_stars
FROM charlotteuser
ORDER BY review_count DESC
LIMIT 5;

 * postgres://postgres@localhost/postgres
5 rows affected.

[('hWDybu_KvYLSdEFzGrniTw', 'Bruce', 10022, Decimal('3.61')),
 ('8RcEwGrFIgkt9WQ35E6SnQ', 'George', 7750, Decimal('3.49')),
 ('Hi10sGSZNxQH3NLyWSZ1oA', 'Fox', 6407, Decimal('3.83')),
 ('Xj0O2l0bp633ebmG468aZw', 'Andrew', 4652, Decimal('3.72')),
 ('XYSDrIef7g4Gmp3lNFVO6A', 'Neal', 4551, Decimal('3.95'))]

In [46]:
%%sql
SELECT business_id, count(business_id) as count
FROM charlottereview
WHERE user_id ='hWDybu_KvYLSdEFzGrniTw'
GROUP BY business_id
ORDER BY count(business_id) DESC
LIMIT 5;

 * postgres://postgres@localhost/postgres
5 rows affected.

[('yymNrvk1cioG5Bn5lWH2QQ', 3),
 ('3dK3PIfmu09FFGi21QYPaA', 2),
 ('0D6NKcLzVfQ3RcEPySmzDw', 2),
 ('0DaSqjKtm8JJEv2nmL4cgw', 2),
 ('1pkPaUtCoVP8Wzf9EXE7og', 2)]

###Favorite Unique Location of most active user 

####Data is grouped by business ID, so the counts are low

In [45]:
%%sql
SELECT cb.name, count(cb.business_id) as count  
FROM
(
SELECT business_id
FROM charlottereview
WHERE user_id = 'hWDybu_KvYLSdEFzGrniTw'
)subq1
LEFT JOIN charlottebusiness cb USING(business_id)
GROUP BY cb.business_id, cb.name
ORDER BY count(cb.business_id) DESC
LIMIT 5;

 * postgres://postgres@localhost/postgres
5 rows affected.

[('Wild Wing Cafe', 3),
 ('Hickory Tavern', 2),
 ('Masa Sushi & Asian Grill', 2),
 ('Hissho Sushi At First In Flight Bar', 2),
 ('US Post Office', 2)]

###Favorite Location of most active user 

####Data is grouped by name so it's independent of the ID number. As a result, he is fan of Starbucks.

In [53]:
%%sql
SELECT cb.name, count(cb.name) as count  
FROM
(
SELECT business_id
FROM charlottereview
WHERE user_id = 'hWDybu_KvYLSdEFzGrniTw'
)subq1
LEFT JOIN charlottebusiness cb USING(business_id)
GROUP BY cb.name
ORDER BY count(cb.name) DESC
LIMIT 5;

 * postgres://postgres@localhost/postgres
5 rows affected.

[('Starbucks', 25),
 ('Harris Teeter', 20),
 ("McDonald's", 14),
 ('Rite Aid', 8),
 ('Target', 8)]

###Most reviewed businesses and average stars

In [51]:
%%sql
SELECT name, review_count, stars
FROM charlottebusiness
WHERE review_count >= 1000
ORDER BY review_count DESC;

 * postgres://postgres@localhost/postgres
6 rows affected.

[('Charlotte Douglas International Airport', 1834, Decimal('3.5')),
 ('The Cowfish Sushi Burger Bar', 1572, Decimal('4')),
 ("Amйlie's French Bakery & Cafй", 1566, Decimal('4')),
 ('Tupelo Honey', 1502, Decimal('4')),
 ('Midwood Smokehouse', 1474, Decimal('4.5')),
 ('Cabo Fish Taco', 1095, Decimal('4'))]